10/data/attachments/dd0ec2ec6e544262.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_f88cbd7e-7760-4471-ab6e-83dbb5fb2da5</nif:username>
            <nif:friendToBeAdded>Tina_decade_Friend_61226_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>